In [22]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [23]:
from src.data_loader import DataLoader
from src.preprocess import cambio_escala, get_all_preferences

In [24]:
datos_personales = DataLoader().load_datos_personales()
datos_personales.head()

   user         name  age sex  occupation  children  y_c_age  o_c_age
0   123  Usuario_123   37   F           3         1        3        8
1   124  Usuario_124   42   M           8         1        3        8
2   125  Usuario_125   35   F          10         0        0        0
3   126  Usuario_126   50   M           4         0        0        0
4   127  Usuario_127   66   F          11         1       35       44

In [ ]:
puntuaciones_usuarios = DataLoader().load_puntuaciones()
puntuaciones_usuarios = cambio_escala(puntuaciones_usuarios)
puntuaciones_usuarios.head(10)

    user  place  score
0    123  17376   8.33
1    123  17377   8.33
2    123  17380   8.33
3    123  17392   3.33
4    123  17395   5.00
5    123  17405   3.33
6    123  17411   0.00
7    123  17421   1.67
8    123  17425   8.33
9    123  17426   8.33
10   123  17432   8.33
11   123  17442   3.33
12   123  17484  10.00
13   123  17509   8.33
14   123  17515   1.67
15   123  17528   0.00
16   123  17530   3.33
17   123  17532   3.33
18   123  17552   8.33

In [5]:
puntuaciones_usuarios_test = DataLoader().load_puntuaciones_test()
puntuaciones_usuarios_test = cambio_escala(puntuaciones_usuarios_test)
puntuaciones_usuarios_test.head(10)

   user  place  score
0   123  17365   8.33
1   123  17366   3.33
2   123  17367   3.33
3   123  17369   8.33
4   123  17371   8.33
5   123  17372   8.33
6   123  17374  10.00
7   123  17375   8.33
8   123  17378   0.00
9   123  17379   6.67

In [6]:
clasificaciones_items = DataLoader().load_clasificacion_items()
clasificaciones_items.head(10)

    item preference  score
0  17365         65     61
1  17365         68     67
2  17366         62     78
3  17366         68     75
4  17367         26     20
5  17367         68     61
6  17369         50     60
7  17369         62     66
8  17369        115     45
9  17371         27     61

In [7]:
items = DataLoader().load_items()
items.head(10)

    item                                              name  views
0  17365                Casa de las Rocas-Museo del Corpus     11
1  17366                              Casa-Museo Benlliure     11
2  17367                          Casa-Museo Blasco Ibañez     11
3  17369                 Centro cultural Fundación Bancaja     30
4  17371                            Centro del Carmen-IVAM     26
5  17372                        Centro Julio Gonzalez-IVAM     23
6  17374                                  El Oceanográfico     35
7  17375       Museo de Bellas Artes de Valencia-San Pio V     22
8  17376  Museo de Cerámica (Palacio Marqués de Dos Aguas)     26
9  17377                     Museo de historia de Valencia     19

In [8]:
preferencias = DataLoader().load_preferencias()
preferencias.head(20)

    preference                        name  father
0            1          Estilos y periodos       0
1            2                     Compras       0
2            3                      Museos       0
3            4           Espacios Abiertos       0
4            5      Arquitectura religiosa       0
5            6      Arquitectura defensiva       0
6            7          Arquitectura civil       0
7            8                 Gastronomia       0
8            9                    Deportes       0
9           10                  Monumentos       0
10          11                        Ocio       0
11          12                 Salud y SPA       0
12          13                     Eventos       0
13          14                       Niños       0
14          15  Patrimonio de la Humanidad       0
15          16                Prehistórico       1
16          17                       Árabe       1
17          18                      Romano       1
18          19                    Medieval       1
19          20                      Gótico       1

In [9]:
usuarios_preferencias = DataLoader().load_usuarios_preferencias()
usuarios_preferencias = usuarios_preferencias.merge(preferencias, how= 'inner', on='preference')
usuarios_preferencias[['user', 'name', 'score', 'father']]
usuarios_preferencias.groupby('father')

In [10]:
ocupaciones = DataLoader().load_ocupaciones()
ocupaciones.head(20)

    occupation                                               name
0            1                                    Fuerzas armadas
1            2  Dirección de las empresas y de las administrac...
2            3  Técnicos y profesionales científicos e intelec...
3            4                  Técnicos y profesionales de apoyo
4            5                   Empleados de tipo administrativo
5            6  Trabajadores de los servicios de restauración,...
6            7  Trabajadores cualificados en la agricultura y ...
7            8  Artesanos y trabajadores cualificados de indus...
8            9  Operadores de instalaciones y maquinaria, y mo...
9           10                       Trabajadores no cualificados
10          11                              Inactivo o desocupado

In [11]:
df_merged = datos_personales.merge(ocupaciones, on='occupation', how='left')
df_merged.head()

,user,name_x,age,sex,occupation,children,y_c_age,o_c_age,name_y
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
1,124,Usuario_124,42,M,8,1,3,8,Artesanos y trabajadores cualificados de indus...
2,125,Usuario_125,35,F,10,0,0,0,Trabajadores no cualificados
3,126,Usuario_126,50,M,4,0,0,0,Técnicos y profesionales de apoyo
4,127,Usuario_127,66,F,11,1,35,44,Inactivo o desocupado

In [13]:
from clustering import k_prototypes_clustering, mostrar_resumen_clusters

df_clusters, resumen_clusters = k_prototypes_clustering(df_merged, 4)

mostrar_resumen_clusters(resumen_clusters)

📌 **Resumen de Clústeres:**


========================================
🔸 Clúster 0 - Usuarios: 3
========================================

📊 Promedios numéricos:
  - age: 74.00
  - children: 1.00
  - y_c_age: 43.67
  - o_c_age: 51.67

📌 Distribuciones categóricas:
  → sex:
      • F: 100.0%
  → name_y:
      • Inactivo o desocupado: 100.0%

========================================
🔸 Clúster 1 - Usuarios: 6
========================================

📊 Promedios numéricos:
  - age: 57.50
  - children: 1.00
  - y_c_age: 28.67
  - o_c_age: 34.17

📌 Distribuciones categóricas:
  → sex:
      • F: 50.0%
      • M: 50.0%
  → name_y:
      • Dirección de las empresas y de las administraciones públicas: 16.7%
      • Fuerzas armadas: 16.7%
      • Técnicos y profesionales científicos e intelectuales: 50.0%
      • Técnicos y profesionales de apoyo: 16.7%

========================================
🔸 Clúster 2 - Usuarios: 21
========================================

📊 Promedios numéricos:
  - age: 45.81
  - children: 0.62
  - y_c_age: 1.90
  - o_c_age: 5.95

📌 Distribuciones categóricas:
  → sex:
      • F: 57.1%
      • M: 42.9%
  → name_y:
      • Artesanos y trabajadores cualificados de industrias manufactureras, construcción, y minería, excepto operadores de instalaciones y maquinaria: 4.8%
      • Dirección de las empresas y de las administraciones públicas: 4.8%
      • Empleados de tipo administrativo: 23.8%
      • Fuerzas armadas: 23.8%
      • Técnicos y profesionales científicos e intelectuales: 38.1%
      • Técnicos y profesionales de apoyo: 4.8%

========================================
🔸 Clúster 3 - Usuarios: 28
========================================

📊 Promedios numéricos:
  - age: 31.18
  - children: 0.14
  - y_c_age: 0.04
  - o_c_age: 0.75

📌 Distribuciones categóricas:
  → sex:
      • F: 71.4%
      • M: 28.6%
  → name_y:
      • Artesanos y trabajadores cualificados de industrias manufactureras, construcción, y minería, excepto operadores de instalaciones y maquinaria: 3.6%
      • Dirección de las empresas y de las administraciones públicas: 14.3%
      • Empleados de tipo administrativo: 7.1%
      • Fuerzas armadas: 21.4%
      • Trabajadores de los servicios de restauración, personales, protección y vendedores de los comercios: 7.1%
      • Trabajadores no cualificados: 7.1%
      • Técnicos y profesionales científicos e intelectuales: 32.1%
      • Técnicos y profesionales de apoyo: 7.1%

========================================

In [55]:
import pandas as pd
import numpy as np

np.random.seed(100)
df = pd.DataFrame(np.random.random((20,5)), columns=list('ABCDE'))
#print (df)

a, b = np.split(df, [int(.8*len(df))])

/home/diego/.cache/pypoetry/virtualenvs/valencia-tour-recommender-n_5Lr2TL-py3.10/lib/python3.10/site-packages/numpy/_core/fromnumeric.py:57: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.
  return bound(*args, **kwds)

In [57]:
b

           A         B         C         D         E
16  0.508699  0.088460  0.528035  0.992158  0.395036
17  0.335596  0.805451  0.754349  0.313066  0.634037
18  0.540405  0.296794  0.110788  0.312640  0.456979
19  0.658940  0.254258  0.641101  0.200124  0.657625

In [40]:
preferencias = DataLoader().load_preferencias()
usuarios_preferencias = DataLoader().load_usuarios_preferencias()

prefs, user_dict = get_all_preferences(preferencias, usuarios_preferencias)

In [43]:
prefs[0]

array([ 0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,  0.,
        0.,  0.,  0.,  8.,  9.,  9.,  8., 10., 10.,  5.,  6.,  6.,  5.,
        5.,  5.,  8.,  8.,  7.,  5.,  9.,  8.,  7.,  4.,  0.,  7.,  9.,
        4.,  0.,  2.,  0.,  0.,  0.,  7.,  9.,  0., 10.,  0.,  8.,  8.,
        0.,  0.,  9.,  0.,  4.,  4.,  0.,  2.,  4.,  0.,  8., 10.,  8.,
        4.,  5.,  9.,  9.,  9.,  0.,  0.,  9.,  8.,  5.,  8., 10.,  9.,
       10.,  8.,  7.,  7.,  8., 10.,  5.,  5.,  5., 10.,  8.,  8.,  9.,
        8.,  6., 10.,  2.,  7.,  7.,  8.,  9., 10., 10., 10., 10.,  4.,
        0.,  4.,  7.,  0.,  4.,  3.,  9.,  0.,  0.,  0.,  0.,  0.])